; ModuleID = 'jpgfile.c'
source_filename = "jpgfile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImageInfo_t = type { [4097 x i8], i64, %struct.anon, i32, [32 x i8], [40 x i8], [20 x i8], i32, i32, i32, i32, i32, i32, float, float, float, float, float, float, float, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [16000 x i8], i32, i32, i32, i32, i8, i32, [10 x i32], i32, i32, [31 x i8], [31 x i8], [20 x i8], i32 }
%struct.anon = type { i8, i8, i16, i16 }
%struct.Section_t = type { i8*, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@ImageInfo = dso_local global %struct.ImageInfo_t zeroinitializer, align 8, !dbg !0
@.str = private unnamed_addr constant [23 x i8] c"Unexpected end of file\00", align 1
@.str.1 = private unnamed_addr constant [48 x i8] c"Extraneous %d padding bytes before section %02X\00", align 1
@Sections = internal global %struct.Section_t* null, align 8, !dbg !45
@SectionsRead = internal global i32 0, align 4, !dbg !41
@.str.2 = private unnamed_addr constant [15 x i8] c"invalid marker\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ImageInfo", scope: !2, file: !3, line: 12, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !27, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "jpgfile.c", directory: ".")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 151, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./jhead.h", directory: ".")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "READ_METADATA", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "READ_IMAGE", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "READ_ALL", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "READ_ANY", value: 5, isUnsigned: true)
!13 = !{!14, !17, !15, !18, !19, !16, !20}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !6, line: 41, baseType: !16)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Section_t", file: !6, line: 67, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 63, size: 128, elements: !23)
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !22, file: !6, line: 64, baseType: !14, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !22, file: !6, line: 65, baseType: !19, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !22, file: !6, line: 66, baseType: !7, size: 32, offset: 96)
!27 = !{!28, !0, !39, !41, !43, !45}
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "JfifHead", scope: !30, file: !3, line: 585, type: !36, isLocal: true, isDefinition: true)
!30 = distinct !DISubprogram(name: "WriteJpegFile", scope: !3, file: !3, line: 565, type: !31, scopeLine: 566, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!35 = !{}
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 144, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 18)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "SectionsAllocated", scope: !2, file: !3, line: 16, type: !19, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "SectionsRead", scope: !2, file: !3, line: 17, type: !19, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "HaveAll", scope: !2, file: !3, line: 18, type: !19, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "Sections", scope: !2, file: !3, line: 15, type: !20, isLocal: true, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo_t", file: !6, line: 142, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 79, size: 163776, elements: !49)
!49 = !{!50, !54, !60, !68, !69, !73, !77, !81, !82, !83, !84, !85, !86, !87, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !110, !111, !112, !113, !114, !115, !116, !120, !121, !122, !126, !127, !128}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !48, file: !6, line: 80, baseType: !51, size: 32776)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32776, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 4097)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "FileDateTime", scope: !48, file: !6, line: 81, baseType: !55, size: 64, offset: 32832)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !56, line: 7, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !58, line: 160, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!59 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "JfifHeader", scope: !48, file: !6, line: 91, baseType: !61, size: 48, offset: 32896)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !6, line: 83, size: 48, elements: !62)
!62 = !{!63, !64, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Present", scope: !61, file: !6, line: 87, baseType: !18, size: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ResolutionUnits", scope: !61, file: !6, line: 88, baseType: !18, size: 8, offset: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "XDensity", scope: !61, file: !6, line: 89, baseType: !66, size: 16, offset: 16)
!66 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "YDensity", scope: !61, file: !6, line: 90, baseType: !66, size: 16, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "FileSize", scope: !48, file: !6, line: 93, baseType: !7, size: 32, offset: 32960)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "CameraMake", scope: !48, file: !6, line: 94, baseType: !70, size: 256, offset: 32992)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 256, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CameraModel", scope: !48, file: !6, line: 95, baseType: !74, size: 320, offset: 33248)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 320, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 40)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "DateTime", scope: !48, file: !6, line: 96, baseType: !78, size: 160, offset: 33568)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 20)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Height", scope: !48, file: !6, line: 97, baseType: !7, size: 32, offset: 33728)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Width", scope: !48, file: !6, line: 97, baseType: !7, size: 32, offset: 33760)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Orientation", scope: !48, file: !6, line: 98, baseType: !19, size: 32, offset: 33792)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "IsColor", scope: !48, file: !6, line: 99, baseType: !19, size: 32, offset: 33824)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Process", scope: !48, file: !6, line: 100, baseType: !19, size: 32, offset: 33856)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "FlashUsed", scope: !48, file: !6, line: 101, baseType: !19, size: 32, offset: 33888)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "FocalLength", scope: !48, file: !6, line: 102, baseType: !88, size: 32, offset: 33920)
!88 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ExposureTime", scope: !48, file: !6, line: 103, baseType: !88, size: 32, offset: 33952)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ApertureFNumber", scope: !48, file: !6, line: 104, baseType: !88, size: 32, offset: 33984)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Distance", scope: !48, file: !6, line: 105, baseType: !88, size: 32, offset: 34016)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "CCDWidth", scope: !48, file: !6, line: 106, baseType: !88, size: 32, offset: 34048)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ExposureBias", scope: !48, file: !6, line: 107, baseType: !88, size: 32, offset: 34080)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "DigitalZoomRatio", scope: !48, file: !6, line: 108, baseType: !88, size: 32, offset: 34112)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "FocalLength35mmEquiv", scope: !48, file: !6, line: 109, baseType: !19, size: 32, offset: 34144)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Whitebalance", scope: !48, file: !6, line: 110, baseType: !19, size: 32, offset: 34176)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "MeteringMode", scope: !48, file: !6, line: 111, baseType: !19, size: 32, offset: 34208)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ExposureProgram", scope: !48, file: !6, line: 112, baseType: !19, size: 32, offset: 34240)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ExposureMode", scope: !48, file: !6, line: 113, baseType: !19, size: 32, offset: 34272)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ISOequivalent", scope: !48, file: !6, line: 114, baseType: !19, size: 32, offset: 34304)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "LightSource", scope: !48, file: !6, line: 115, baseType: !19, size: 32, offset: 34336)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "DistanceRange", scope: !48, file: !6, line: 116, baseType: !19, size: 32, offset: 34368)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "xResolution", scope: !48, file: !6, line: 118, baseType: !88, size: 32, offset: 34400)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "yResolution", scope: !48, file: !6, line: 119, baseType: !88, size: 32, offset: 34432)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ResolutionUnit", scope: !48, file: !6, line: 120, baseType: !19, size: 32, offset: 34464)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Comments", scope: !48, file: !6, line: 122, baseType: !107, size: 128000, offset: 34496)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128000, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 16000)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "CommentWidthchars", scope: !48, file: !6, line: 123, baseType: !19, size: 32, offset: 162496)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ThumbnailOffset", scope: !48, file: !6, line: 125, baseType: !19, size: 32, offset: 162528)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ThumbnailSize", scope: !48, file: !6, line: 126, baseType: !19, size: 32, offset: 162560)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "LargestExifOffset", scope: !48, file: !6, line: 127, baseType: !19, size: 32, offset: 162592)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ThumbnailAtEnd", scope: !48, file: !6, line: 129, baseType: !18, size: 8, offset: 162624)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ThumbnailSizeOffset", scope: !48, file: !6, line: 131, baseType: !19, size: 32, offset: 162656)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "DateTimeOffsets", scope: !48, file: !6, line: 133, baseType: !117, size: 320, offset: 162688)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 320, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 10)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "numDateTimeTags", scope: !48, file: !6, line: 134, baseType: !19, size: 32, offset: 163008)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "GpsInfoPresent", scope: !48, file: !6, line: 136, baseType: !19, size: 32, offset: 163040)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "GpsLat", scope: !48, file: !6, line: 137, baseType: !123, size: 248, offset: 163072)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 248, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 31)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "GpsLong", scope: !48, file: !6, line: 138, baseType: !123, size: 248, offset: 163320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "GpsAlt", scope: !48, file: !6, line: 139, baseType: !78, size: 160, offset: 163568)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "QualityGuess", scope: !48, file: !6, line: 141, baseType: !19, size: 32, offset: 163744)
!129 = !{i32 7, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{i32 1, !"wchar_size", i32 4}
!132 = !{!"clang version 12.0.0"}
!133 = distinct !DISubprogram(name: "ReadJpegSections", scope: !3, file: !3, line: 119, type: !134, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!134 = !DISubroutineType(types: !135)
!135 = !{!19, !136, !191}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !138, line: 7, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !140, line: 49, size: 1728, elements: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!141 = !{!142, !143, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !158, !160, !161, !162, !164, !166, !168, !172, !175, !177, !180, !183, !184, !185, !189, !190}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !139, file: !140, line: 51, baseType: !19, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !139, file: !140, line: 54, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !139, file: !140, line: 55, baseType: !144, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !139, file: !140, line: 56, baseType: !144, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !139, file: !140, line: 57, baseType: !144, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !139, file: !140, line: 58, baseType: !144, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !139, file: !140, line: 59, baseType: !144, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !139, file: !140, line: 60, baseType: !144, size: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !139, file: !140, line: 61, baseType: !144, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !139, file: !140, line: 64, baseType: !144, size: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !139, file: !140, line: 65, baseType: !144, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !139, file: !140, line: 66, baseType: !144, size: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !139, file: !140, line: 68, baseType: !156, size: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !140, line: 36, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !139, file: !140, line: 70, baseType: !159, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !139, file: !140, line: 72, baseType: !19, size: 32, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !139, file: !140, line: 73, baseType: !19, size: 32, offset: 928)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !139, file: !140, line: 74, baseType: !163, size: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !58, line: 152, baseType: !59)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !139, file: !140, line: 77, baseType: !165, size: 16, offset: 1024)
!165 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !139, file: !140, line: 78, baseType: !167, size: 8, offset: 1040)
!167 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !139, file: !140, line: 79, baseType: !169, size: 8, offset: 1048)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 1)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !139, file: !140, line: 81, baseType: !173, size: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !140, line: 43, baseType: null)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !139, file: !140, line: 89, baseType: !176, size: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !58, line: 153, baseType: !59)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !139, file: !140, line: 91, baseType: !178, size: 64, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !140, line: 37, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !139, file: !140, line: 92, baseType: !181, size: 64, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !140, line: 38, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !139, file: !140, line: 93, baseType: !159, size: 64, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !139, file: !140, line: 94, baseType: !17, size: 64, offset: 1408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !139, file: !140, line: 95, baseType: !186, size: 64, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !187, line: 46, baseType: !188)
!187 = !DIFile(filename: "/home/raoxue/node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "")
!188 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !139, file: !140, line: 96, baseType: !19, size: 32, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !139, file: !140, line: 98, baseType: !78, size: 160, offset: 1568)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReadMode_t", file: !6, line: 156, baseType: !5)
!192 = !DILocalVariable(name: "infile", arg: 1, scope: !133, file: !3, line: 119, type: !136)
!193 = !DILocation(line: 119, column: 30, scope: !133)
!194 = !DILocalVariable(name: "ReadMode", arg: 2, scope: !133, file: !3, line: 119, type: !191)
!195 = !DILocation(line: 119, column: 49, scope: !133)
!196 = !DILocalVariable(name: "a", scope: !133, file: !3, line: 121, type: !19)
!197 = !DILocation(line: 121, column: 9, scope: !133)
!198 = !DILocalVariable(name: "HaveCom", scope: !133, file: !3, line: 122, type: !19)
!199 = !DILocation(line: 122, column: 9, scope: !133)
!200 = !DILocation(line: 124, column: 15, scope: !133)
!201 = !DILocation(line: 124, column: 9, scope: !133)
!202 = !DILocation(line: 124, column: 7, scope: !133)
!203 = !DILocation(line: 126, column: 9, scope: !204)
!204 = distinct !DILexicalBlock(scope: !133, file: !3, line: 126, column: 9)
!205 = !DILocation(line: 126, column: 11, scope: !204)
!206 = !DILocation(line: 126, column: 19, scope: !204)
!207 = !DILocation(line: 126, column: 28, scope: !204)
!208 = !DILocation(line: 126, column: 22, scope: !204)
!209 = !DILocation(line: 126, column: 36, scope: !204)
!210 = !DILocation(line: 126, column: 9, scope: !133)
!211 = !DILocation(line: 127, column: 9, scope: !212)
!212 = distinct !DILexicalBlock(scope: !204, file: !3, line: 126, column: 45)
!213 = !DILocation(line: 130, column: 67, scope: !133)
!214 = !DILocation(line: 130, column: 35, scope: !133)
!215 = !DILocation(line: 131, column: 42, scope: !133)
!216 = !DILocation(line: 133, column: 5, scope: !133)
!217 = !DILocalVariable(name: "itemlen", scope: !218, file: !3, line: 134, type: !19)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 133, column: 12)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 133, column: 5)
!220 = distinct !DILexicalBlock(scope: !133, file: !3, line: 133, column: 5)
!221 = !DILocation(line: 134, column: 13, scope: !218)
!222 = !DILocalVariable(name: "prev", scope: !218, file: !3, line: 135, type: !19)
!223 = !DILocation(line: 135, column: 13, scope: !218)
!224 = !DILocalVariable(name: "marker", scope: !218, file: !3, line: 136, type: !19)
!225 = !DILocation(line: 136, column: 13, scope: !218)
!226 = !DILocalVariable(name: "ll", scope: !218, file: !3, line: 137, type: !19)
!227 = !DILocation(line: 137, column: 13, scope: !218)
!228 = !DILocalVariable(name: "lh", scope: !218, file: !3, line: 137, type: !19)
!229 = !DILocation(line: 137, column: 16, scope: !218)
!230 = !DILocalVariable(name: "got", scope: !218, file: !3, line: 137, type: !19)
!231 = !DILocation(line: 137, column: 20, scope: !218)
!232 = !DILocalVariable(name: "Data", scope: !218, file: !3, line: 138, type: !14)
!233 = !DILocation(line: 138, column: 17, scope: !218)
!234 = !DILocation(line: 140, column: 9, scope: !218)
!235 = !DILocation(line: 142, column: 14, scope: !218)
!236 = !DILocation(line: 143, column: 15, scope: !237)
!237 = distinct !DILexicalBlock(scope: !218, file: !3, line: 143, column: 9)
!238 = !DILocation(line: 143, column: 14, scope: !237)
!239 = !DILocation(line: 144, column: 28, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 143, column: 23)
!241 = distinct !DILexicalBlock(scope: !237, file: !3, line: 143, column: 9)
!242 = !DILocation(line: 144, column: 22, scope: !240)
!243 = !DILocation(line: 144, column: 20, scope: !240)
!244 = !DILocation(line: 145, column: 17, scope: !245)
!245 = distinct !DILexicalBlock(scope: !240, file: !3, line: 145, column: 17)
!246 = !DILocation(line: 145, column: 24, scope: !245)
!247 = !DILocation(line: 145, column: 32, scope: !245)
!248 = !DILocation(line: 145, column: 35, scope: !245)
!249 = !DILocation(line: 145, column: 40, scope: !245)
!250 = !DILocation(line: 145, column: 17, scope: !240)
